Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: أفأمنتم أن يخسف بكم جانب البر أو يرسل عليكم حاصبا ثم لا تجدوا لكم وكيلا
en: Feel ye then secure that He will not cause a slope of the land to engulf you, or send a sand-storm upon you, and then ye will find that ye have no protector?

source: أم أمنتم أن يعيدكم فيه تارة أخرى فيرسل عليكم قاصفا من الريح فيغرقكم بما كفرتم ثم لا تجدوا لكم علينا به تبيعا
en: Or feel ye secure that He will not return you to that (plight) a second time, and send against you a hurricane of wind and drown you for your thanklessness, and then ye will not find therein that ye have any avenger against Us?

source: ولقد كرمنا بني آدم وحملناهم في البر والبحر ورزقناهم من الطيبات وفضلناهم على كثير ممن خلقنا تفضيلا
en: Verily we have honoured the Children of Adam. We carry them on the land and the sea, and have made provision of good things for them, and have preferred them above many of those whom We created with a marked preferment.

source: يوم ندعو كل أناس بإمامهم فمن أوتي كتابه بيمينه فأولئك يقرءون كتابهم ولا يظلمون فتيلا
en: On the day when We shall summon all men with their record, whoso is given his book in his right hand - such will read their book and they will not be wronged a shred.

source: ومن كان في هذه أعمى فهو في الآخرة أعمى وأضل سبيلا
en: Whoso is blind here will be blind in the Hereafter, and yet further from the road.

source: وإن كادوا ليفتنونك عن الذي أوحينا إليك لتفتري علينا غيره وإذا لاتخذوك خليلا
en: And they indeed strove hard to beguile thee (Muhammad) away from that wherewith We have inspired thee, that thou shouldst invent other than it against Us; and then would they have accepted thee as a friend.

source: ولولا أن ثبتناك لقد كدت تركن إليهم شيئا قليلا
en: And if We had not made thee wholly firm thou mightest almost have inclined unto them a little.

source: إذا لأذقناك ضعف الحياة وضعف الممات ثم لا تجد لك علينا نصيرا
en: Then had we made thee taste a double (punishment) of living and a double (punishment) of dying, then hadst thou found no helper against Us.

source: وإن كادوا ليستفزونك من الأرض ليخرجوك منها وإذا لا يلبثون خلافك إلا قليلا
en: And they indeed wished to scare thee from the land that they might drive thee forth from thence, and then they would have stayed (there) but a little after thee.

source: سنة من قد أرسلنا قبلك من رسلنا ولا تجد لسنتنا تحويلا
en: (Such was Our) method in the case of those whom We sent before thee (to mankind), and thou wilt not find for Our method aught of power to change.

source: أقم الصلاة لدلوك الشمس إلى غسق الليل وقرآن الفجر إن قرآن الفجر كان مشهودا
en: Establish worship at the going down of the sun until the dark of night, and (the recital of) the Qur'an at dawn. Lo! (the recital of) the Qur'an at dawn is ever witnessed.

source: ومن الليل فتهجد به نافلة لك عسى أن يبعثك ربك مقاما محمودا
en: And some part of the night awake for it, a largess for thee. It may be that thy Lord will raise thee to a praised estate.

source: وقل رب أدخلني مدخل صدق وأخرجني مخرج صدق واجعل لي من لدنك سلطانا نصيرا
en: And say: My Lord! Cause me to come in with a firm incoming and to go out with a firm outgoing. And give me from Thy presence a sustaining Power.

source: وقل جاء الحق وزهق الباطل إن الباطل كان زهوقا
en: And say: Truth hath come and falsehood hath vanished away. Lo! falsehood is ever bound to vanish.

source: وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا
en: And We reveal of the Qur'an that which is a healing and a mercy for believers though it increase the evil-doers in naught save ruin.

source: وإذا أنعمنا على الإنسان أعرض ونأى بجانبه وإذا مسه الشر كان يئوسا
en: And when We make life pleasant unto man, he turneth away and is averse; and when ill toucheth him he is in despair.

source: قل كل يعمل على شاكلته فربكم أعلم بمن هو أهدى سبيلا
en: Say: Each one doth according to his rule of conduct, and thy Lord is Best Aware of him whose way is right.

source: ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا
en: They are asking thee concerning the Spirit. Say: The Spirit is by command of my Lord, and of knowledge ye have been vouchsafed but little.

source: ولئن شئنا لنذهبن بالذي أوحينا إليك ثم لا تجد لك به علينا وكيلا
en: And if We willed We could withdraw that which We have revealed unto thee, then wouldst thou find no guardian for thee against Us in respect thereof.

source: إلا رحمة من ربك إن فضله كان عليك كبيرا
en: (It is naught) save mercy from thy Lord. Lo! His kindness unto thee was ever great.

source: قل لئن اجتمعت الإنس والجن على أن يأتوا بمثل هذا القرآن لا يأتون بمثله ولو كان بعضهم لبعض ظهيرا
en: Say: Verily, though mankind and the jinn should assemble to produce the like of this Qur'an, they could not produce the like thereof though they were helpers one of another.

source: ولقد صرفنا للناس في هذا القرآن من كل مثل فأبى أكثر الناس إلا كفورا
en: And verily We have displayed for mankind in this Qur'an all kind of similitudes, but most of mankind refuse aught save disbelief.

source: وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعا
en: And they say: We will not put faith in thee till thou cause a spring to gush forth from the earth for us;

source: أو تكون لك جنة من نخيل وعنب فتفجر الأنهار خلالها تفجيرا
en: Or thou have a garden of date-palms and grapes, and cause rivers to gush forth therein abundantly;

source: أو تسقط السماء كما زعمت علينا كسفا أو تأتي بالله والملائكة قبيلا
en: Or thou cause the heaven to fall upon us piecemeal, as thou hast pretended, or bring Allah and the angels as a warrant;

source: أو يكون لك بيت من زخرف أو ترقى في السماء ولن نؤمن لرقيك حتى تنزل علينا كتابا نقرؤه قل سبحان ربي هل كنت إلا بشرا رسولا
en: Or thou have a house of gold; or thou ascend up into heaven, and even then we will put no faith in thine ascension till thou bring down for us a book that we can read. Say (O Muhammad): My Lord be Glorified! Am I aught save a mortal messenger?

source: وما منع الناس أن يؤمنوا إذ جاءهم الهدى إلا أن قالوا أبعث الله بشرا رسولا
en: And naught prevented mankind from believing when the guidance came unto them save that they said: Hath Allah sent a mortal as (His) messenger?

source: قل لو كان في الأرض ملائكة يمشون مطمئنين لنزلنا عليهم من السماء ملكا رسولا
en: Say: If there were in the earth angels walking secure, We had sent down for them from heaven an angel as messenger.

source: قل كفى بالله شهيدا بيني وبينكم إنه كان بعباده خبيرا بصيرا
en: Say: Allah sufficeth for a witness between me and you. Lo! He is Knower, Seer of His slaves.

source: ومن يهد الله فهو المهتد ومن يضلل فلن تجد لهم أولياء من دونه ونحشرهم يوم القيامة على وجوههم عميا وبكما وصما مأواهم جهنم كلما خبت زدناهم سعيرا
en: And he whom Allah guideth, he is led aright; while, as for him whom He sendeth astray, for them thou wilt find no protecting friends beside Him, and We shall assemble them on the Day of Resurrection on their faces, blind, dumb and deaf; their habitation will be hell; whenever it abateth, We increase the flame for them.

source: ذلك جزاؤهم بأنهم كفروا بآياتنا وقالوا أإذا كنا عظاما ورفاتا أإنا لمبعوثون خلقا جديدا
en: That is their reward because they disbelieved Our revelations and said: When we are bones and fragments shall we, forsooth, be raised up as a new creation?

source: أولم يروا أن الله الذي خلق السماوات والأرض قادر على أن يخلق مثلهم وجعل لهم أجلا لا ريب فيه فأبى الظالمون إلا كفورا
en: Have they not seen that Allah Who created the heavens and the earth is Able to create the like of them, and hath appointed for them an end whereof there is no doubt? But the wrong-doers refuse aught save disbelief.

source: قل لو أنتم تملكون خزائن رحمة ربي إذا لأمسكتم خشية الإنفاق وكان الإنسان قتورا
en: Say (unto them): If ye possessed the treasures of the mercy of my Lord, ye would surely hold them back for fear of spending, for man was ever grudging.

source: ولقد آتينا موسى تسع آيات بينات فاسأل بني إسرائيل إذ جاءهم فقال له فرعون إني لأظنك يا موسى مسحورا
en: And verily We gave unto Moses nine tokens, clear proofs (of Allah's Sovereignty). Do but ask the Children of Israel how he came unto them, then Pharaoh said unto him: Lo! I deem thee one bewitched, O Moses.

source: قال لقد علمت ما أنزل هؤلاء إلا رب السماوات والأرض بصائر وإني لأظنك يا فرعون مثبورا
en: He said: In truth thou knowest that none sent down these (portents) save the Lord of the heavens and the earth as proofs, and lo! (for my part) I deem thee lost, O Pharaoh.

source: فأراد أن يستفزهم من الأرض فأغرقناه ومن معه جميعا
en: And he wished to scare them from the land, but We drowned him and those with him, all together.

source: وقلنا من بعده لبني إسرائيل اسكنوا الأرض فإذا جاء وعد الآخرة جئنا بكم لفيفا
en: And We said unto the Children of Israel after him: Dwell in the land; but when the promise of the Hereafter cometh to pass We shall bring you as a crowd gathered out of various nations.

source: وبالحق أنزلناه وبالحق نزل وما أرسلناك إلا مبشرا ونذيرا
en: With truth have We sent it down, and with truth hath it descended. And We have sent thee as naught else save a bearer of good tidings and a warner.

source: وقرآنا فرقناه لتقرأه على الناس على مكث ونزلناه تنزيلا
en: And (it is) a Qur'an that We have divided, that thou mayst recite it unto mankind at intervals, and We have revealed it by (successive) revelation.

source: قل آمنوا به أو لا تؤمنوا إن الذين أوتوا العلم من قبله إذا يتلى عليهم يخرون للأذقان سجدا
en: Say: Believe therein or believe not, lo! those who were given knowledge before it, when it is read unto them, fall down prostrate on their faces, adoring,

source: ويقولون سبحان ربنا إن كان وعد ربنا لمفعولا
en: Saying: Glory to our Lord! Verily the promise of our Lord must be fulfilled.

source: ويخرون للأذقان يبكون ويزيدهم خشوعا
en: They fall down on their faces, weeping, and it increaseth humility in them.

source: قل ادعوا الله أو ادعوا الرحمن أيا ما تدعوا فله الأسماء الحسنى ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا
en: Say (unto mankind): Cry unto Allah, or cry unto the Beneficent, unto whichsoever ye cry (it is the same). His are the most beautiful names. And thou (Muhammad), be not loud-voiced in thy worship nor yet silent therein, but follow a way between.

source: وقل الحمد لله الذي لم يتخذ ولدا ولم يكن له شريك في الملك ولم يكن له ولي من الذل وكبره تكبيرا
en: And say: Praise be to Allah, Who hath not taken unto Himself a son, and Who hath no partner in the Sovereignty, nor hath He any protecting friend through dependence. And magnify Him with all magnificence.

source: الحمد لله الذي أنزل على عبده الكتاب ولم يجعل له عوجا
en: Praise be to Allah Who hath revealed the Scripture unto His slave, and hath not placed therein any crookedness,

source: قيما لينذر بأسا شديدا من لدنه ويبشر المؤمنين الذين يعملون الصالحات أن لهم أجرا حسنا
en: (But hath made it) straight, to give warning of stern punishment from Him, and to bring unto the believers who do good works the news that theirs will be a fair reward,

source: ماكثين فيه أبدا
en: Wherein they will abide for ever;

source: وينذر الذين قالوا اتخذ الله ولدا
en: And to warn those who say: Allah hath chosen a son,

source: ما لهم به من علم ولا لآبائهم كبرت كلمة تخرج من أفواههم إن يقولون إلا كذبا
en: (A thing) whereof they have no knowledge, nor (had) their fathers, Dreadful is the word that cometh out of their mouths. They speak naught but a lie.

source: فلعلك باخع نفسك على آثارهم إن لم يؤمنوا بهذا الحديث أسفا
en: Yet it may be, if they believe not in this statement, that thou (Muhammad) wilt torment thy soul with grief over their footsteps.

source: إنا جعلنا ما على الأرض زينة لها لنبلوهم أيهم أحسن عملا
en: Lo! We have placed all that is on the earth as an ornament thereof that We may try them: which of them is best in conduct.

source: وإنا لجاعلون ما عليها صعيدا جرزا
en: And lo! We shall make all that is thereon a barren mound.

source: أم حسبت أن أصحاب الكهف والرقيم كانوا من آياتنا عجبا
en: Or deemest thou that the People of the Cave and the Inscription are a wonder among Our portents?

source: إذ أوى الفتية إلى الكهف فقالوا ربنا آتنا من لدنك رحمة وهيئ لنا من أمرنا رشدا
en: When the young men fled for refuge to the Cave and said: Our Lord! Give us mercy from Thy presence, and shape for us right conduct in our plight.

source: فضربنا على آذانهم في الكهف سنين عددا
en: Then We sealed up their hearing in the Cave for a number of years.

source: ثم بعثناهم لنعلم أي الحزبين أحصى لما لبثوا أمدا
en: And afterward We raised them up that We might know which of the two parties would best calculate the time that they had tarried.

source: نحن نقص عليك نبأهم بالحق إنهم فتية آمنوا بربهم وزدناهم هدى
en: We narrate unto thee their story with truth. Lo! they were young men who believed in their Lord, and We increased them in guidance.

source: وربطنا على قلوبهم إذ قاموا فقالوا ربنا رب السماوات والأرض لن ندعو من دونه إلها لقد قلنا إذا شططا
en: And We made firm their hearts when they stood forth and said: Our Lord is the Lord of the heavens and the earth. We cry unto no Allah beside Him, for then should we utter an enormity.

source: هؤلاء قومنا اتخذوا من دونه آلهة لولا يأتون عليهم بسلطان بين فمن أظلم ممن افترى على الله كذبا
en: These, our people, have chosen (other) gods beside Him though they bring no clear warrant (vouchsafed) to them. And who doth greater wrong than he who inventeth a lie concerning Allah?

source: وإذ اعتزلتموهم وما يعبدون إلا الله فأووا إلى الكهف ينشر لكم ربكم من رحمته ويهيئ لكم من أمركم مرفقا
en: And when ye withdraw from them and that which they worship except Allah, then seek refuge in the Cave; your Lord will spread for you of His mercy and will prepare for you a pillow in your plight.

source: وترى الشمس إذا طلعت تزاور عن كهفهم ذات اليمين وإذا غربت تقرضهم ذات الشمال وهم في فجوة منه ذلك من آيات الله من يهد الله فهو المهتد ومن يضلل فلن تجد له وليا مرشدا
en: And thou mightest have seen the sun when it rose move away from their cave to the right, and when it set go past them on the left, and they were in the cleft thereof. That was (one) of the portents of Allah. He whom Allah guideth, he indeed is led aright, and he whom He sendeth astray, for him thou wilt not find a guiding friend.

source: وتحسبهم أيقاظا وهم رقود ونقلبهم ذات اليمين وذات الشمال وكلبهم باسط ذراعيه بالوصيد لو اطلعت عليهم لوليت منهم فرارا ولملئت منهم رعبا
en: And thou wouldst have deemed them waking though they were asleep, and We caused them to turn over to the right and the left, and their dog stretching out his paws on the threshold. If thou hadst observed them closely thou hadst assuredly turned away from them in flight, and hadst been filled with awe of them.

source: وكذلك بعثناهم ليتساءلوا بينهم قال قائل منهم كم لبثتم قالوا لبثنا يوما أو بعض يوم قالوا ربكم أعلم بما لبثتم فابعثوا أحدكم بورقكم هذه إلى المدينة فلينظر أيها أزكى طعاما فليأتكم برزق منه وليتلطف ولا يشعرن بكم أحدا
en: And in like manner We awakened them that they might question one another. A speaker from among them said: How long have ye tarried? They said: We have tarried a day or some part of a day, (Others) said: Your Lord best knoweth what ye have tarried. Now send one of you with this your silver coin unto the city, and let him see what food is purest there and bring you a supply thereof. Let him be courteous and let no man know of you.

source: إنهم إن يظهروا عليكم يرجموكم أو يعيدوكم في ملتهم ولن تفلحوا إذا أبدا
en: For they, if they should come to know of you, will stone you or turn you back to their religion; then ye will never prosper.

source: وكذلك أعثرنا عليهم ليعلموا أن وعد الله حق وأن الساعة لا ريب فيها إذ يتنازعون بينهم أمرهم فقالوا ابنوا عليهم بنيانا ربهم أعلم بهم قال الذين غلبوا على أمرهم لنتخذن عليهم مسجدا
en: And in like manner We disclosed them (to the people of the city) that they might know that the promise of Allah is true, and that, as for the Hour, there is no doubt concerning it. When (the people of the city) disputed of their case among themselves, they said: Build over them a building; their Lord knoweth best concerning them. Those who won their point said: We verily shall build a place of worship over them.

source: سيقولون ثلاثة رابعهم كلبهم ويقولون خمسة سادسهم كلبهم رجما بالغيب ويقولون سبعة وثامنهم كلبهم قل ربي أعلم بعدتهم ما يعلمهم إلا قليل فلا تمار فيهم إلا مراء ظاهرا ولا تستفت فيهم منهم أحدا
en: (Some) will say: They were three, their dog the fourth, and (some) say: Five, their dog the sixth, guessing at random; and (some) say: Seven, and their dog the eighth. Say (O Muhammad): My Lord is Best Aware of their number. None knoweth them save a few. So contend not concerning them except with an outward contending, and ask not any of them to pronounce concerning them.

source: ولا تقولن لشيء إني فاعل ذلك غدا
en: And say not of anything: Lo! I shall do that tomorrow,

source: إلا أن يشاء الله واذكر ربك إذا نسيت وقل عسى أن يهدين ربي لأقرب من هذا رشدا
en: Except if Allah will. And remember thy Lord when thou forgettest, and say: It may be that my Lord guideth me unto a nearer way of truth than this.

source: ولبثوا في كهفهم ثلاث مائة سنين وازدادوا تسعا
en: And (it is said) they tarried in their Cave three hundred years and add nine.

source: قل الله أعلم بما لبثوا له غيب السماوات والأرض أبصر به وأسمع ما لهم من دونه من ولي ولا يشرك في حكمه أحدا
en: Say: Allah is Best Aware how long they tarried. His is the Invisible of the heavens and the earth. How clear of sight is He and keen of hearing! They have no protecting friend beside Him, and He maketh none to share in His government.

source: واتل ما أوحي إليك من كتاب ربك لا مبدل لكلماته ولن تجد من دونه ملتحدا
en: And recite that which hath been revealed unto thee of the Scripture of thy Lord. There is none who can change His words, and thou wilt find no refuge beside Him.

source: واصبر نفسك مع الذين يدعون ربهم بالغداة والعشي يريدون وجهه ولا تعد عيناك عنهم تريد زينة الحياة الدنيا ولا تطع من أغفلنا قلبه عن ذكرنا واتبع هواه وكان أمره فرطا
en: Restrain thyself along with those who cry unto their Lord at morn and evening, seeking His Countenance; and let not thine eyes overlook them, desiring the pomp of the life of the world; and obey not him whose heart We have made heedless of Our remembrance, who followeth his own lust and whose case hath been abandoned.

source: وقل الحق من ربكم فمن شاء فليؤمن ومن شاء فليكفر إنا أعتدنا للظالمين نارا أحاط بهم سرادقها وإن يستغيثوا يغاثوا بماء كالمهل يشوي الوجوه بئس الشراب وساءت مرتفقا
en: Say: (It is) the truth from the Lord of you (all). Then whosoever will, let him believe, and whosoever will, let him disbelieve. Lo! We have prepared for disbelievers Fire. Its tent encloseth them. If they ask for showers, they will be showered with water like to molten lead which burneth the faces. Calamitous the drink and ill the resting-place!

source: إن الذين آمنوا وعملوا الصالحات إنا لا نضيع أجر من أحسن عملا
en: Lo! as for those who believe and do good works - Lo! We suffer not the reward of one whose work is goodly to be lost.

source: أولئك لهم جنات عدن تجري من تحتهم الأنهار يحلون فيها من أساور من ذهب ويلبسون ثيابا خضرا من سندس وإستبرق متكئين فيها على الأرائك نعم الثواب وحسنت مرتفقا
en: As for such, theirs will be Gardens of Eden, wherein rivers flow beneath them; therein they will be given armlets of gold and will wear green robes of finest silk and gold embroidery, reclining upon throne therein. Blest the reward, and fair the resting-place!

source: واضرب لهم مثلا رجلين جعلنا لأحدهما جنتين من أعناب وحففناهما بنخل وجعلنا بينهما زرعا
en: Coin for them a similitude: Two men, unto one of whom We had assigned two gardens of grapes, and We had surrounded both with date-palms and had put between them tillage.

source: كلتا الجنتين آتت أكلها ولم تظلم منه شيئا وفجرنا خلالهما نهرا
en: Each of the gardens gave its fruit and withheld naught thereof. And We caused a river to gush forth therein.

source: وكان له ثمر فقال لصاحبه وهو يحاوره أنا أكثر منك مالا وأعز نفرا
en: And he had fruit. And he said unto his comrade, when he spake with him: I am more than thee in wealth, and stronger in respect of men.

source: ودخل جنته وهو ظالم لنفسه قال ما أظن أن تبيد هذه أبدا
en: And he went into his garden, while he (thus) wronged himself. He said: I think not that all this will ever perish.

source: وما أظن الساعة قائمة ولئن رددت إلى ربي لأجدن خيرا منها منقلبا
en: I think not that the Hour will ever come, and if indeed I am brought back unto my Lord I surely shall find better than this as a resort.

source: قال له صاحبه وهو يحاوره أكفرت بالذي خلقك من تراب ثم من نطفة ثم سواك رجلا
en: His comrade, when he (thus) spake with him, exclaimed: Disbelievest thou in Him Who created thee of dust, then of a drop (of seed), and then fashioned thee a man?

source: لكنا هو الله ربي ولا أشرك بربي أحدا
en: But He is Allah, my Lord, and I ascribe unto my Lord no partner.

source: ولولا إذ دخلت جنتك قلت ما شاء الله لا قوة إلا بالله إن ترن أنا أقل منك مالا وولدا
en: If only, when thou enteredst thy garden, thou hadst said: That which Allah willeth (will come to pass)! There is no strength save in Allah! Though thou seest me as less than thee in wealth and children,

source: فعسى ربي أن يؤتين خيرا من جنتك ويرسل عليها حسبانا من السماء فتصبح صعيدا زلقا
en: Yet it may be that my Lord will give me better than thy garden, and will send on it a bolt from heaven, and some morning it will be a smooth hillside,

source: أو يصبح ماؤها غورا فلن تستطيع له طلبا
en: Or some morning the water thereof will be lost in the earth so that thou canst not make search for it.

source: وأحيط بثمره فأصبح يقلب كفيه على ما أنفق فيها وهي خاوية على عروشها ويقول يا ليتني لم أشرك بربي أحدا
en: And his fruit was beset (with destruction). Then began he to wring his hands for all that he had spent upon it, when (now) it was all ruined on its trellises, and to say: Would that I had ascribed no partner to my Lord!

source: ولم تكن له فئة ينصرونه من دون الله وما كان منتصرا
en: And he had no troop of men to help him as against Allah, nor could he save himself.

source: هنالك الولاية لله الحق هو خير ثوابا وخير عقبا
en: In this case is protection only from Allah, the True, He is Best for reward, and best for consequence.

source: واضرب لهم مثل الحياة الدنيا كماء أنزلناه من السماء فاختلط به نبات الأرض فأصبح هشيما تذروه الرياح وكان الله على كل شيء مقتدرا
en: And coin for them the similitude of the life of the world as water which We send down from the sky, and the vegetation of the earth mingleth with it and then becometh dry twigs that the winds scatter. Allah is able to do all things.

source: المال والبنون زينة الحياة الدنيا والباقيات الصالحات خير عند ربك ثوابا وخير أملا
en: Wealth and children are an ornament of the life of the world. But the good deeds which endure are better in thy Lord's sight for reward, and better in respect of hope.

source: ويوم نسير الجبال وترى الأرض بارزة وحشرناهم فلم نغادر منهم أحدا
en: And (bethink you of) the Day when we remove the hills and ye see the earth emerging, and We gather them together so as to leave not one of them behind.

source: وعرضوا على ربك صفا لقد جئتمونا كما خلقناكم أول مرة بل زعمتم ألن نجعل لكم موعدا
en: And they are set before thy Lord in ranks (and it is said unto them): Now verily have ye come unto Us as We created you at the first. But ye thought that We had set no tryst for you.

source: ووضع الكتاب فترى المجرمين مشفقين مما فيه ويقولون يا ويلتنا مال هذا الكتاب لا يغادر صغيرة ولا كبيرة إلا أحصاها ووجدوا ما عملوا حاضرا ولا يظلم ربك أحدا
en: And the Book is placed, and thou seest the guilty fearful of that which is therein, and they say: What kind of a Book is this that leaveth not a small thing nor a great thing but hath counted it! And they find all that they did confronting them, and thy Lord wrongeth no-one.
